# -*- coding: utf-8 -*-
"""Урок 3 часть 2 - Демонстрация.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1h0Go16k6B44R3induu6_YxQtaBjySGWB

## Часть 2 Эпизод 1 – FOR IN

### Перебор списков: Цикл for
"""

items_list = ["f","f","g","h","j"]

for item in items_list:
  print(item)

"""Посмотрим визуализацию в http://pythontutor.com/"""

ex_gfs = ["Иветта", "Лизетта", "Мюзетта", "Жанетта", "Жоржетта"]


for ex in ex_gfs:
    print(ex)


print("Покуда я с вами - клянусь, моя песня не спета")

reasons = ["ты", "все твои мечты", "боль"]
num = 1


for reason in reasons:
  print(f"{num} причина - это {reason}")
  num += 1

"""### Цикл и условие можно совмещать

"""

words = ["воронка", "лавировали", "тележка", "маленький"]


for word in words:
  if "р" in word:
    print(f"{word} – картавое слово")

"""Посмотрим визуализацию в http://pythontutor.com/

### Задачка к эпизоду 1

Дан список трат, просуммировать их и вывести общие расходы

Вывод:

`Всего потрачено: 4280`
"""

expenses = [200,  450,  320, 1100, 650, 280, 325, 490, 830, 420]
total = 0

for payment in expenses:
  total += payment

print(f"Всего потрачено: {total}")

"""Теперь посмотрим задачку в http://pythontutor.com/

### И еще одна задачка

Дан список медалек, посчитать сколько золотых, серебрянных и бронзовых. Ответ должен выводиться в формате:

*  Золотых: 5
*  Серебрянных: 3
*  Бронзовых: 1
*  Шоколадных: 1
"""

medals = ["gold", "gold", "silver", "gold", "bronze", "silver", "gold", "gold", "silver", "chocolate"]

gold_count = 0
silver_count = 0
bronze_count = 0
chocolate_count = 0

for medal in medals:
  if medal == "gold":
    gold_count += 1
  elif medal == "silver":
    silver_count += 1
  elif medal == "bronze":
    bronze_count += 1
  elif medal == "chocolate":
    chocolate_count += 1

print(f"Золотых: {gold_count}")
print(f"Серебрянных: {silver_count}")
print(f"Бронзовых: {bronze_count}")
print(f"Шоколадных: {chocolate_count}")

"""## Часть 2  Эпизод 2 – While

### Цикл while - повторение блока кода с условием

Хотя мы только добрались до них, циклы while – это самые классические циклы
"""

answer = None


while answer != 'пошли':
  answer = input("Пошли тусить? ")

print("Я знал, что ты согласишься!")

# абсолютно честно 
# случайно выбранное число
num = 4
is_solved = False

while not is_solved:
  ans = input("Угадай число ")
  if int(ans) == num:
    print("Угадал!")
    is_solved = True
  else:
    print("Неа")

"""Выход из цикла, не дожидаясь завершения - break

"""

while True:
  print("До брейка")
  break
  print("После брейка")

print("После цикла")

"""Можем переписать предыдущий пример"""

# абсолютно честно 
# случайно выбранное число
num = 4

while True:
  ans = input("Угадай число ")
  if int(ans) == num:
    print("Угадал!")
    break
  else:
    print("Неа")

cities = ['Ривенделл', 'Минас-Тирит', 'Эребор', 'Шир']

for city in cities:
  if city == 'Эребор':
    print('Ну это уже Эребор')
    break
  else:
    print(city)

"""### Задачка эпизода 2

Мы должны некоторую сумму.

Выводится месяц и остаток долга, предлагается ввести сколько в этом месяце мы погасим. 

Продолжаем, пока долг не исчезнет

Ваш долг – 10000

Внесите сумму2000

Ваш долг – 8000

Внесите сумму5000

Ваш долг – 3000

Внесите сумму3000

Ваши долги выплачены
"""

debt = 10000

while debt > 0:
  print(f"Ваш долг – {debt}")
  payment = int(input("Введите сумму для погашения: "))
  debt -= payment

print("Ваши долги выплачены")

"""## Часть 2  Эпизод 3 – Range

### Перебирать в цикле можно не только списки
"""

# как и в срезах, верхняя граница не включается

for num in range(1, 6):
  print("смеяться 1 минуту")

# по умолчанию начинаем от нуля

for num in range(10):
  print(f"{num} * 9 = {num * 9}")

"""### Можно перебирать индексы"""

actions = ['buy it', 'use it', 'break it', 'fix it']

# action_indexes = range(4)
action_indexes = range(len(actions)) # [0, 1, 2, 3]

for act_idx in action_indexes:
   print(act_idx + 1, actions[act_idx])

"""### Задачка эпизода 3

Стоимость нового ноутбука выводится со стандартного ввода, например 100 000, вывести по ней рассрочку на несколько месяцев

*   1 платеж -- 100 000 / мес
*   2 платеж -- 50 000 / мес
*   3 платеж -- 33 000 / мес
*   4 платеж -- 25 000 / мес
*   5 платеж -- 20 000 / мес
*   6 платеж - 16 500 / мес
*   100 000 платежей - 1 / мес

"""

price = int(input("Введите полную сумму покупки "))

for month in range(1, 13):
  monthly_payment = int(price / month)
  print(f"{month} месяцев - {monthly_payment} руб")

"""## Селфчек"""

# Как перебрать список через for in?

girls = ["Иветта", "Лизетта", "Мюзетта", "Жанетта", "Жоржетта"]

for girl in girls:
  print(girl)

# Как перебрать список через for in range

girls = ["Иветта", "Лизетта", "Мюзетта", "Жанетта", "Жоржетта"]

for i in range(len(girls)):
  print(girls[i])

# Как пронумеровать элементы списка с единицы

girls = ["Иветта", "Лизетта", "Мюзетта", "Жанетта", "Жоржетта"]

for i in range(len(girls)):
  print(i+1,girls[i])

#Как создать бесконечный цикл
 
while True:
  print("Привет, повисим немножко?")

#Как завершить цикл досрочно
 
c = 100

while True:
  print("Привет, повисим немножко?")
  if c==0:
    break;
  c-=1