'''3. ⚙️ Уникализация списка
3 из 15
На ферме можно встретить несколько видов рыб. Чтобы составить полный список, Алёна обращается к перечню всех аквариумов, прудов и искусственных водоемов и выписывает, кто где живет. Теперь нужно получить уникальный список и отсортировать по алфавиту. А потом начать изучать каждый вид отдельно.

Уникализируйте список и выведите количество рыб, затем каждую рыбу на отдельной строке. Вот так:

Всего 3 видов рыб
сельдь-черноспинка
морская камбала
тунец'''

raw_list = ["сельдь-черноспинка", "морская камбала", "тунец", "ставрида", "морской окунь", "треска", "сайра",
"морская камбала", "ставрида", "треска", "треска", "треска", "тунец", "ставрида", "морская камбала",
"тунец", "морская камбала", "морская камбала", "морская камбала", "морская камбала", "тунец",
           ]
raw_list_set = set(raw_list)
#print(raw_list_set) 
unique_list = list(raw_list_set)
unique_list.sort()
print(f"Всего {len(raw_list_set)} видов рыб")
for raw in unique_list:
  print(raw)

'''7. ⚙️ Цифровые карточки
7 из 15
Первая задача — оцифровать карточки сотрудников. Раньше личные дела хранились в бумажном виде, так что придется создать структуру для хранения данных. Хорошо, что коллектив небольшой и данных собрано немного. Такая задача должна решиться быстро.

Перенесите информацию внутрь словаря. Ключ словаря — это фамилия сотрудника, а внутри словаря лежит еще один словарь с ф. и. о., паспортными данными, датой рождения, телефоном и должностью:

employees = { 
  "Фесенко": {"f": ... , "i": ..., "o": ..., "pass": ..., "birthday": ... ,"phone": ..., "position": ...},
  "Алексеев": {"f": ... , "i": ..., "o": ..., "pass": ..., "birthday": ...,"phone": ..., "position": ...},
...
}

Будьте внимательны, следите за пробелами при копировании информации.
Допишите внутри словаря информацию о сотрудниках:
# Информация о пользователях
# Ключи словаря: f i o pass birthday phone position
# Пользователи для добавления
# Киселёв / Всеволод / Эдуардович / 342 020 / 14 ноября 2001 года / +7 (908) 161-64-28 / главный инженер
# Довлатова / Эмилия /  Ефимовна / 342 000 / 18 мая 2001 года / +7 (924) 588-50-15 / технолог
# Аверин / Мартын / Егорович / 217 340 / 12 февраля 1981 года / +7 (933) 768-22-15 / технолог
# Князева / Августа / Егоровна / 320 021 / 2 июля 1984 года / +7 (965) 886-27-01 / расфасовщик
# Шанская / Аграфена / Семёновна / 116 404 / 7 июля 1982 года/ +7 (954) 940-47-96 / психолог для рыб'''

employees = {
"Киселёв": {"f":"Киселёв", "i":"Всеволод", "o":"Эдуардович", "pass":"342 020", "birthday":"14 ноября 2001 года" ,"phone":"+7 (908) 161-64-28", "position":"главный инженер"},
"Довлатова": {"f":"Довлатова" , "i":"Эмилия", "o":"Ефимовна", "pass":"342 000", "birthday":"18 мая 2001 года" ,"phone":"+7 (924) 588-50-15", "position":"технолог"},
"Аверин": {"f":"Аверин", "i":"Мартын", "o":"Егорович", "pass":"217 340", "birthday":"12 февраля 1981 года" ,"phone":"+7 (933) 768-22-15", "position":"технолог"},
"Князева": {"f":"Князева", "i":"Августа", "o":"Егоровна", "pass":"320 021", "birthday":"2 июля 1984 года" ,"phone":"+7 (965) 886-27-01", "position":"расфасовщик"},
"Шанская": {"f":"Шанская", "i":"Аграфена", "o":"Семёновна", "pass":"116 404", "birthday":"7 июля 1982 года" ,"phone":"+7 (954) 940-47-96", "position":"психолог для рыб"}
}

for employee in employees.values():
  for key, value in employee.items():
      print(key, value)
  print("-")

'''8. ⚙️ Рыбий грипп
8 из 15
С рыбками хорошо работать — они ведут себя тихо и не кусаются. Главное — работникам не заболеть!

Перенесите в подсписок vaccinated только сотрудников, которые прошли вакцинацию, а остальных отправьте в not_vaccinated. Затем распечатайте оба списка в таком формате:

Вакцинированные:
Киселёв Всеволод Эдуардович 
...
Остальные:
Довлатова Эмилия Ефимовна'''

employees = [

 {"fio": "Киселёв Всеволод Эдуардович ", "vaccinated": True},
 {"fio": "Довлатова Эмилия Ефимовна", "vaccinated": False},
 {"fio": "Аверин Мартын Егорович", "vaccinated": True},
 {"fio": "Князева Августа Егоровна", "vaccinated": False}, 
 {"fio": "Шанская Аграфена Семёновна", "vaccinated": True},
 {"fio": "Куприна Марина Викторовна", "vaccinated": False},
 {"fio": "Селезнёв Константин Игоревич", "vaccinated": False},   
]
vaccinated = []
not_vaccinated = []

for epm in employees:
  if epm["vaccinated"] == True:
    vaccinated.append(epm)
  else:
    not_vaccinated.append(epm)

print(f'Вакцинированные:')
for vac in vaccinated:
  print(vac["fio"])
print(f'Остальные:')
for vacc in not_vaccinated:
  print(vacc["fio"])

'''9. ⚙️ Пресноводная рыба
Некоторые рыбы предпочитают морскую воду, некоторые — пресную. Разделите список словарей на два, затем выведите названия вида из каждого словаря в строку. Вот так:

Морские: Тунец, Скумбрия
Пресноводные: Красноперка, Карась'''

fish = [
{"specie": "Белуга", "water": "fresh"},
{"specie": "Карась", "water": "fresh"},
{"specie": "Красноперка", "water": "fresh"},

{"specie": "Морской окунь", "water": "sea"},
{"specie": "Тунец", "water": "sea"},
{"specie": "Скумбрия", "water": "sea"},
]

sea_water = []
fresh_water = []

for fi in fish:
  if fi["water"] == "fresh":
    fresh_water.append(fi["specie"])
  else:
    sea_water.append(fi["specie"])

sea_water_str = ', '.join(sea_water)
fresh_water_str = ', '.join(fresh_water)


print(f'Морские: {sea_water_str}')

print(f'Пресноводные: {fresh_water_str}')


'''0. ⚙️ Проверка существования
10 из 15
В словаре хранится информация о некоторых рыбах.

Когда пользователь вводит с клавиатуры название рыбы, программа должна вывести информацию о ней.

Если такой рыбы в словаре нет, появляется текст «Информация не найдена».

Формат вывода:
Лещ: Единственный представитель рода лещей из семейства карповых.
Пресноводная рыба
Промысловый размер: 29 см

Формат вывода:
Информация не найдена'''

species = [
{"specie": "Лещ", "len": "29", "sea": False, "desc": "Единственный представитель рода лещей из семейства карповых."},
{"specie":"Щука", "len": "45", "sea": False, "desc": "Распространена в пресных водах Евразии и Северной Америки. Живет обычно в прибрежной зоне, в водных зарослях, в непроточных или слабопроточных водах. "},
{"specie":"Треска","len": "33", "sea": True, "desc": "Треска встречается от прибрежной полосы до континентального шельфа, но в открытом море над большими глубинами редко. Ее жизненный цикл привязан к морским течениям Северной Атлантики."},
{"specie":"Камбала", "len": "25", "sea": True, "desc": " Тело плоское, сильно сжато с боков, глаза расположены не по бокам головы, а смещены на одну ее сторону. Плавательного пузыря нет. "},
{"specie":"Лосось", "len": "50", "sea": False,"desc": "Проходная форма обитает в северной части Атлантического океана. Заходит на нерест в реки от Португалии и Испании до Баренцева моря."},
]

def fish(s):
    desc = []
    sea = []
    len = ''
    for fi in species:
        if fi["specie"] == s:
            desc.append(fi["desc"])
            len = fi["len"]
            if fi["sea"] == False:
                sea.append('Пресноводная рыба')
            else:
                sea.append('Морская рыба')
        
        break
    return f'{s}: {"".join(desc)}\n{"".join(sea)}\nПромысловый размер: {len} см'
    
s = input()
for i in species:
 if s in i["specie"]:
    print(fish(s))
    break
 else:
    print('Информация не найдена')
    break


'''11. ⚙️ Перекладывание словарей
11 из 15
Одна из типичных задач при работе с данными — перекладывание их из одного формата в другой. Мы хотим отправить несколько контейнеров с живой рыбой в соседний питомник, но чтобы занести во внутреннюю систему задачу от внешнего заказчика, нужно перевести заказ из «их формата» в «наш формат».

Формат заказчика:

{"skolko": 5.0, "poroda": "тунец", "sred_razmer": 300}

Наш формат:

{"count": 5, "specie": "Тунец" , "avg_size": 30 }

Заказчик называет ключи транслитом, хранит количество рыб в типе с точкой, размер рыбы в миллиметрах, а породу пишет с маленькой буквы. Просто катастрофа, а не заказчик! Придется писать конвертер.'''

order = [
 {"skolko": 5.0, "poroda": "тунец", "sred_razmer": 300},
 {"skolko": 15.0, "poroda": "окунь", "sred_razmer": 250},
 {"skolko": 20.0, "poroda": "щука", "sred_razmer": 460},
]

order_converted = []

for i in order:
  order_converted.append({"count":int(i["skolko"])})
  order_converted.append({"specie":i["poroda"]})
  order_converted.append({"avg_size":int(i["sred_razmer"]/10)})

for item in order_converted:
  for key, value in item.items():
      print(key, value)

'''12. ⚙️ Рыбное удаление
12 из 15
В списке хранится информация о прудах, где живут рыбы. Удалите из списка все пруды, где живут тунцы.'''

ponds = [
    {"pk": 1, "volume": 10000, "fish": "тунец"},
    {"pk": 192,"volume": 20000, "fish": "морская камбала"},
    {"pk": 206,"volume": 10000, "fish": "треска"},
    {"pk": 322,"volume": 25000, "fish": "тунец"}, 
    {"pk": 420,"volume": 20000, "fish": "морская камбала"},
    {"pk": 704,"volume": 10000, "fish": "треска"},
    {"pk": 920,"volume": 25000, "fish": "тунец"},
]

ponds_new = []

for i in ponds:
  if i["fish"] != "тунец":
    ponds_new.append(i)

for pond in ponds_new:
    print(pond["pk"])

'''13. ⚙️ Кортежи и функции
13 из 15
Поиск по спискам — не самая удобная операция, если значения хранятся внутри словарей. Давайте напишем функцию, которая выполняет поиск. Обратите внимание, функция должна возвращать два значения: название рыбы и воду, в которой она живет. Используйте кортеж для этой цели.

Пример вывода: Белуга fresh'''

fish = [
{"specie": "Белуга", "water": "fresh"},
{"specie": "Карась", "water": "fresh"},
{"specie": "Красноперка", "water": "fresh"},

{"specie": "Морской окунь", "water": "sea"},
{"specie": "Тунец", "water": "sea"},
{"specie": "Скумбрия", "water": "sea"},
]

def get_fish(fish_name):
    fi = ''
    wa = ''
    for i in fish:
      if i["specie"] == fish_name:
        fi = i["specie"]
        wa = i["water"]
    return fi, wa

fish_name = input()
fish, water = get_fish(fish_name)
print(fish, water)