# Напишите программу, которая запрашивает целое число
# и выводит следующее за ним. Для запроса чисел используйте
# конструкцию задания 19.1.

x = int(input('Введите число: '))
print ('Следующее число: ', x + 1)

# 26. Напишите программу, которая запрашивает два целых чис-
# ла и выводит их сумму. Для запроса чисел используйте кон-
# струкцию задания 19.1.

x = int(input('Первое число: '))
y = int(input('Второе число: '))
print ('Сумма чисел: ', x + y )

