# Битовые операции (двоичные, шестнадцатиричные, восьмиричные системы исчисления)
x = 5
y = 7
print ('x =', x, '=', bin(x)) # x = 5 = 0b101
print ('x =', x, '=', hex(x)) # x = 5 = 0x5
print ('20 =', x, '=', hex(25))
print ('x =', x, '=', oct(x))
print ('x |', x, '=', bin(x | y)) # "побитовое или"
print ('x &', x, '=', bin(x & y)) # "побитовое и"
print ('x *', x, '=', bin(x * y))
print ('~x =', ~x) # переворот бит
print ('x << 1 =', bin(x << 1)) # побитовый сдвиг вправо или влево
print ('x >> 1 =', bin(x >> 1))
